{
    "architectures": [
        "ArcFaceClassifier"
    ],
    "model_type": "custom_arcface",
    "auto_map": {
        "AutoConfig": "configuration_arcface.ArcFaceConfig",
        "AutoModelForImageClassification": "modeling_arcface.ArcFaceClassifier"
    },
    "backbone": "timm/convnextv2_nano.fcmae_ft_in22k_in1k",
    "num_classes": 100,
    "arcface_s": 15.0,
    "arcface_m": 0.15,
    "arcface_k": 1,
    "image_size": {
        "height": 224,
        "width": 224
    },
    "id2label": {
        "0": "acacia_mangium_willd",
        "1": "adansonia_digitata_l",
        "2": "aegiphila_macrantha_ducke",
        "3": "allamanda_cathartica_l",
        "4": "anacardium_occidentale_l",
        "5": "aniba_guianensis_aubl",
        "6": "aniba_megaphylla_mez",
        "7": "annona_ambotay_aubl",
        "8": "annona_foetida_mart",
        "9": "annona_glabra_l",
        "10": "annona_muricata_l",
        "11": "asclepias_curassavica_l",
        "12": "averrhoa_carambola_l",
        "13": "caesalpinia_pulcherrima_l_sw",
        "14": "cajanus_cajan_l_millsp",
        "15": "cassipourea_guianensis_aubl",
        "16": "ceiba_pentandra_l_gaertn",
        "17": "ceratopteris_thalictroides_l_brongn",
        "18": "chrysothemis_pulchella_donn_ex_sims_decne",
        "19": "cipura_paludosa_aubl",
        "20": "clerodendrum_paniculatum_l",
        "21": "congea_tomentosa_roxb",
        "22": "costus_arabicus_l",
        "23": "costus_scaber_ruiz_pav",
        "24": "costus_spiralis_jacq_roscoe",
        "25": "couratari_guianensis_aubl",
        "26": "crotalaria_retusa_l",
        "27": "croton_schiedeanus_schltdl",
        "28": "dicranopteris_flexuosa_schrad_underw",
        "29": "dicranopteris_pectinata_willd_underw",
        "30": "didymochlaena_truncatula_sw_j_sm",
        "31": "diospyros_capreifolia_mart_ex_hiern",
        "32": "eichhornia_crassipes_mart_solms",
        "33": "erythrina_fusca_lour",
        "34": "erythroxylum_fimbriatum_peyr",
        "35": "erythroxylum_macrophyllum_cav",
        "36": "erythroxylum_squamatum_sw",
        "37": "eschweilera_parviflora_aubl_miers",
        "38": "eschweilera_pedicellata_rich_samori",
        "39": "euphorbia_cotinifolia_l",
        "40": "euphorbia_heterophylla_l",
        "41": "euphorbia_prostrata_aiton",
        "42": "euphorbia_thymifolia_l",
        "43": "euphorbia_tithymaloides_l",
        "44": "evodianthus_funifer_poit_lindm",
        "45": "gmelina_philippensis_cham",
        "46": "guatteria_ouregou_aubl_dunal",
        "47": "guatteria_scandens_ducke",
        "48": "heliconia_chartacea_lane_ex_barreiros",
        "49": "hernandia_guianensis_aubl",
        "50": "hibiscus_rosa_sinensis_l",
        "51": "holmskioldia_sanguinea_retz",
        "52": "hura_crepitans_l",
        "53": "hymenophyllum_hirsutum_l_sw",
        "54": "hyptis_lanceolata_poir",
        "55": "inga_alba_sw_willd",
        "56": "inga_capitata_desv",
        "57": "inga_edulis_mart",
        "58": "jatropha_curcas_l",
        "59": "jatropha_gossypiifolia_l",
        "60": "lembocarpus_amoenus_leeuwenb",
        "61": "mangifera_indica_l",
        "62": "maripa_glabra_choisy",
        "63": "merremia_umbellata_l_hallier_f",
        "64": "mimosa_pigra_l",
        "65": "mimosa_pudica_l",
        "66": "nectandra_cissiflora_nees",
        "67": "nephrolepis_biserrata_sw_schott",
        "68": "ocimum_campechianum_mill",
        "69": "ocotea_cernua_nees_mez",
        "70": "ocotea_floribunda_sw_mez",
        "71": "ocotea_longifolia_kunth",
        "72": "ocotea_oblonga_meisn_mez",
        "73": "ocotea_puberula_rich_nees",
        "74": "olfersia_cervina_l_kunze",
        "75": "oreopanax_capitatus_jacq_decne_planch",
        "76": "orthosiphon_aristatus_blume_miq",
        "77": "piper_peltatum_l",
        "78": "pityrogramma_calomelanos_l_link",
        "79": "potalia_amara_aubl",
        "80": "psidium_guineense_sw",
        "81": "pteridium_arachnoideum_kaulf_maxon",
        "82": "punica_granatum_l",
        "83": "ricinus_communis_l",
        "84": "rollinia_mucosa_jacq_baill",
        "85": "sapium_glandulosum_l_morong",
        "86": "sinningia_incarnata_aubl_dldenham",
        "87": "sloanea_grandiflora_sm",
        "88": "sloanea_guianensis_aubl_benth",
        "89": "sphyrospermum_cordifolium_benth",
        "90": "spondias_mombin_l",
        "91": "syngonanthus_caulescens_poir_ruhland",
        "92": "tapirira_guianensis_aubl",
        "93": "tonina_fluviatilis_aubl",
        "94": "trichomanes_diversifrons_bory_mett_ex_sadeb",
        "95": "trichomanes_punctatum_poir",
        "96": "turnera_ulmifolia_l",
        "97": "xylopia_aromatica_lam_mart",
        "98": "xylopia_cayennensis_maas",
        "99": "xylopia_frutescens_aubl"
    },
    "label2id": {
        "acacia_mangium_willd": 0,
        "adansonia_digitata_l": 1,
        "aegiphila_macrantha_ducke": 2,
        "allamanda_cathartica_l": 3,
        "anacardium_occidentale_l": 4,
        "aniba_guianensis_aubl": 5,
        "aniba_megaphylla_mez": 6,
        "annona_ambotay_aubl": 7,
        "annona_foetida_mart": 8,
        "annona_glabra_l": 9,
        "annona_muricata_l": 10,
        "asclepias_curassavica_l": 11,
        "averrhoa_carambola_l": 12,
        "caesalpinia_pulcherrima_l_sw": 13,
        "cajanus_cajan_l_millsp": 14,
        "cassipourea_guianensis_aubl": 15,
        "ceiba_pentandra_l_gaertn": 16,
        "ceratopteris_thalictroides_l_brongn": 17,
        "chrysothemis_pulchella_donn_ex_sims_decne": 18,
        "cipura_paludosa_aubl": 19,
        "clerodendrum_paniculatum_l": 20,
        "congea_tomentosa_roxb": 21,
        "costus_arabicus_l": 22,
        "costus_scaber_ruiz_pav": 23,
        "costus_spiralis_jacq_roscoe": 24,
        "couratari_guianensis_aubl": 25,
        "crotalaria_retusa_l": 26,
        "croton_schiedeanus_schltdl": 27,
        "dicranopteris_flexuosa_schrad_underw": 28,
        "dicranopteris_pectinata_willd_underw": 29,
        "didymochlaena_truncatula_sw_j_sm": 30,
        "diospyros_capreifolia_mart_ex_hiern": 31,
        "eichhornia_crassipes_mart_solms": 32,
        "erythrina_fusca_lour": 33,
        "erythroxylum_fimbriatum_peyr": 34,
        "erythroxylum_macrophyllum_cav": 35,
        "erythroxylum_squamatum_sw": 36,
        "eschweilera_parviflora_aubl_miers": 37,
        "eschweilera_pedicellata_rich_samori": 38,
        "euphorbia_cotinifolia_l": 39,
        "euphorbia_heterophylla_l": 40,
        "euphorbia_prostrata_aiton": 41,
        "euphorbia_thymifolia_l": 42,
        "euphorbia_tithymaloides_l": 43,
        "evodianthus_funifer_poit_lindm": 44,
        "gmelina_philippensis_cham": 45,
        "guatteria_ouregou_aubl_dunal": 46,
        "guatteria_scandens_ducke": 47,
        "heliconia_chartacea_lane_ex_barreiros": 48,
        "hernandia_guianensis_aubl": 49,
        "hibiscus_rosa_sinensis_l": 50,
        "holmskioldia_sanguinea_retz": 51,
        "hura_crepitans_l": 52,
        "hymenophyllum_hirsutum_l_sw": 53,
        "hyptis_lanceolata_poir": 54,
        "inga_alba_sw_willd": 55,
        "inga_capitata_desv": 56,
        "inga_edulis_mart": 57,
        "jatropha_curcas_l": 58,
        "jatropha_gossypiifolia_l": 59,
        "lembocarpus_amoenus_leeuwenb": 60,
        "mangifera_indica_l": 61,
        "maripa_glabra_choisy": 62,
        "merremia_umbellata_l_hallier_f": 63,
        "mimosa_pigra_l": 64,
        "mimosa_pudica_l": 65,
        "nectandra_cissiflora_nees": 66,
        "nephrolepis_biserrata_sw_schott": 67,
        "ocimum_campechianum_mill": 68,
        "ocotea_cernua_nees_mez": 69,
        "ocotea_floribunda_sw_mez": 70,
        "ocotea_longifolia_kunth": 71,
        "ocotea_oblonga_meisn_mez": 72,
        "ocotea_puberula_rich_nees": 73,
        "olfersia_cervina_l_kunze": 74,
        "oreopanax_capitatus_jacq_decne_planch": 75,
        "orthosiphon_aristatus_blume_miq": 76,
        "piper_peltatum_l": 77,
        "pityrogramma_calomelanos_l_link": 78,
        "potalia_amara_aubl": 79,
        "psidium_guineense_sw": 80,
        "pteridium_arachnoideum_kaulf_maxon": 81,
        "punica_granatum_l": 82,
        "ricinus_communis_l": 83,
        "rollinia_mucosa_jacq_baill": 84,
        "sapium_glandulosum_l_morong": 85,
        "sinningia_incarnata_aubl_dldenham": 86,
        "sloanea_grandiflora_sm": 87,
        "sloanea_guianensis_aubl_benth": 88,
        "sphyrospermum_cordifolium_benth": 89,
        "spondias_mombin_l": 90,
        "syngonanthus_caulescens_poir_ruhland": 91,
        "tapirira_guianensis_aubl": 92,
        "tonina_fluviatilis_aubl": 93,
        "trichomanes_diversifrons_bory_mett_ex_sadeb": 94,
        "trichomanes_punctatum_poir": 95,
        "turnera_ulmifolia_l": 96,
        "xylopia_aromatica_lam_mart": 97,
        "xylopia_cayennensis_maas": 98,
        "xylopia_frutescens_aubl": 99
    }
}